betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dci.c
/**
  *
  * @file    apm32f4xx_dal_dci.c
  * @brief   DCI DAL module driver
  *          This file provides firmware functions to manage the following
  *          functionalities of the Digital Camera Interface (DCI) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Error functions
  *
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
      The sequence below describes how to use this driver to capture image
      from a camera module connected to the DCI Interface.
      This sequence does not take into account the configuration of the
      camera module, which should be made before to configure and enable
      the DCI to capture images.

    (#) Program the required configuration through following parameters:
        horizontal and vertical polarity, pixel clock polarity, Capture Rate,
        Synchronization Mode, code of the frame delimiter and data width 
        using DAL_DCI_Init() function.

    (#) Configure the DMA2_Stream1 channel1 to transfer Data from DCI DR
        register to the destination memory buffer.

    (#) Program the required configuration through following parameters:
        DCI mode, destination memory Buffer address and the data length
        and enable capture using DAL_DCI_Start_DMA() function.

    (#) Optionally, configure and Enable the CROP feature to select a rectangular
        window from the received image using DAL_DCI_ConfigCrop()
        and DAL_DCI_EnableCROP() functions

    (#) The capture can be stopped using DAL_DCI_Stop() function.

    (#) To control DCI state you can use the function DAL_DCI_GetState().

     *** DCI DAL driver macros list ***
     =============================================
     [..]
       Below the list of most used macros in DCI DAL driver.
       
      (+) __DAL_DCI_ENABLE: Enable the DCI peripheral.
      (+) __DAL_DCI_DISABLE: Disable the DCI peripheral.
      (+) __DAL_DCI_GET_FLAG: Get the DCI pending flags.
      (+) __DAL_DCI_CLEAR_FLAG: Clear the DCI pending flags.
      (+) __DAL_DCI_ENABLE_IT: Enable the specified DCI interrupts.
      (+) __DAL_DCI_DISABLE_IT: Disable the specified DCI interrupts.
      (+) __DAL_DCI_GET_IT_SOURCE: Check whether the specified DCI interrupt has occurred or not.

     [..]
       (@) You can refer to the DCI DAL driver header file for more useful macros
      
    *** Callback registration ***
    =============================

    The compilation define USE_DAL_DCI_REGISTER_CALLBACKS when set to 1
    allows the user to configure dynamically the driver callbacks.
    Use functions DAL_DCI_RegisterCallback() to register a user callback.

    Function DAL_DCI_RegisterCallback() allows to register following callbacks:
      (+) FrameEventCallback : DCI Frame Event.
      (+) VsyncEventCallback : DCI Vsync Event.
      (+) LineEventCallback  : DCI Line Event.
      (+) ErrorCallback      : DCI error.
      (+) MspInitCallback    : DCI MspInit.
      (+) MspDeInitCallback  : DCI MspDeInit.
    This function takes as parameters the DAL peripheral handle, the callback ID
    and a pointer to the user callback function.

    Use function DAL_DCI_UnRegisterCallback() to reset a callback to the default
    weak (surcharged) function.
    DAL_DCI_UnRegisterCallback() takes as parameters the DAL peripheral handle,
    and the callback ID.
    This function allows to reset following callbacks:
      (+) FrameEventCallback : DCI Frame Event.
      (+) VsyncEventCallback : DCI Vsync Event.
      (+) LineEventCallback  : DCI Line Event.
      (+) ErrorCallback      : DCI error.
      (+) MspInitCallback    : DCI MspInit.
      (+) MspDeInitCallback  : DCI MspDeInit.

    By default, after the DAL_DCI_Init and if the state is DAL_DCI_STATE_RESET
    all callbacks are reset to the corresponding legacy weak (surcharged) functions:
    examples FrameEventCallback(), DAL_DCI_ErrorCallback().
    Exception done for MspInit and MspDeInit callbacks that are respectively
    reset to the legacy weak (surcharged) functions in the DAL_DCI_Init
    and  DAL_DCI_DeInit only when these callbacks are null (not registered beforehand).
    If not, MspInit or MspDeInit are not null, the DAL_DCI_Init and DAL_DCI_DeInit
    keep and use the user MspInit/MspDeInit callbacks (registered beforehand).

    Callbacks can be registered/unregistered in READY state only.
    Exception done for MspInit/MspDeInit callbacks that can be registered/unregistered
    in READY or RESET state, thus registered (user) MspInit/DeInit callbacks can be used
    during the Init/DeInit.
    In that case first register the MspInit/MspDeInit user callbacks
    using DAL_DCI_RegisterCallback before calling DAL_DCI_DeInit
    or DAL_DCI_Init function.

    When the compilation define USE_DAL_DCI_REGISTER_CALLBACKS is set to 0 or
    not defined, the callback registering feature is not available
    and weak (surcharged) callbacks are used.
	
  @endverbatim
  *
  */

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */
/** @defgroup DCI DCI
  * @brief DCI DAL module driver
  * @{
  */

#ifdef DAL_DCI_MODULE_ENABLED

#if defined(APM32F407xx) || defined(APM32F417xx)
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define DAL_TIMEOUT_DCI_STOP    14U  /* Set timeout to 1s  */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static void       DCI_DMAXferCplt(DMA_HandleTypeDef *hdma);
static void       DCI_DMAError(DMA_HandleTypeDef *hdma);

/* Exported functions --------------------------------------------------------*/

/** @defgroup DCI_Exported_Functions DCI Exported Functions
  * @{
  */

