betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dci.c
/** @defgroup DCI_Exported_Functions_Group1 Initialization and Configuration functions
  *  @brief   Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
                ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Initialize and configure the DCI
      (+) De-initialize the DCI 

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the DCI according to the specified
  *         parameters in the DCI_InitTypeDef and create the associated handle.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval DAL status
  */
__weak DAL_StatusTypeDef DAL_DCI_Init(DCI_HandleTypeDef *hdci)
{
  /* Check the DCI peripheral state */
  if(hdci == NULL)
  {
     return DAL_ERROR;
  }

  /* Check function parameters */
  ASSERT_PARAM(IS_DCI_ALL_INSTANCE(hdci->Instance));
  ASSERT_PARAM(IS_DCI_PCKPOLARITY(hdci->Init.PCKPolarity));
  ASSERT_PARAM(IS_DCI_VSPOLARITY(hdci->Init.VSPolarity));
  ASSERT_PARAM(IS_DCI_HSPOLARITY(hdci->Init.HSPolarity));
  ASSERT_PARAM(IS_DCI_SYNCHRO(hdci->Init.SynchroMode));
  ASSERT_PARAM(IS_DCI_CAPTURE_RATE(hdci->Init.CaptureRate));
  ASSERT_PARAM(IS_DCI_EXTENDED_DATA(hdci->Init.ExtendedDataMode));
  ASSERT_PARAM(IS_DCI_MODE_JPEG(hdci->Init.JPEGMode));

  if(hdci->State == DAL_DCI_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hdci->Lock = DAL_UNLOCKED;
    /* Init the low level hardware */
  /* Init the DCI Callback settings */
#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)
    hdci->FrameEventCallback = DAL_DCI_FrameEventCallback; /* Legacy weak FrameEventCallback  */ 
    hdci->VsyncEventCallback = DAL_DCI_VsyncEventCallback; /* Legacy weak VsyncEventCallback  */ 
    hdci->LineEventCallback  = DAL_DCI_LineEventCallback;  /* Legacy weak LineEventCallback   */  
    hdci->ErrorCallback      = DAL_DCI_ErrorCallback;      /* Legacy weak ErrorCallback       */ 
    
    if(hdci->MspInitCallback == NULL)  
    {
      /* Legacy weak MspInit Callback        */
      hdci->MspInitCallback = DAL_DCI_MspInit;
    }
    /* Initialize the low level hardware (MSP) */
    hdci->MspInitCallback(hdci);
#else  
    /* Init the low level hardware : GPIO, CLOCK, NVIC and DMA */
    DAL_DCI_MspInit(hdci);
#endif /* (USE_DAL_DCI_REGISTER_CALLBACKS) */
    DAL_DCI_MspInit(hdci);
  }

  /* Change the DCI state */
  hdci->State = DAL_DCI_STATE_BUSY;

  /* Set DCI parameters */
  /* Configures the HS, VS, DE and PC polarity */
  hdci->Instance->CTRL &= ~(DCI_CTRL_PXCLKPOL | DCI_CTRL_HSYNCPOL  | DCI_CTRL_VSYNCPOL  | DCI_CTRL_EXDMOD_0 |
                           DCI_CTRL_EXDMOD_1  | DCI_CTRL_FCRCFG_0 | DCI_CTRL_FCRCFG_1 | DCI_CTRL_JPGFM  |
                           DCI_CTRL_ESYNCSEL);
  hdci->Instance->CTRL |=  (uint32_t)(hdci->Init.SynchroMode | hdci->Init.CaptureRate | \
                                     hdci->Init.VSPolarity  | hdci->Init.HSPolarity  | \
                                     hdci->Init.PCKPolarity | hdci->Init.ExtendedDataMode | \
                                     hdci->Init.JPEGMode);

  if(hdci->Init.SynchroMode == DCI_SYNCHRO_EMBEDDED)
  {
    hdci->Instance->ESYNCC = (((uint32_t)hdci->Init.SyncroCode.FrameStartCode)    |
                             ((uint32_t)hdci->Init.SyncroCode.LineStartCode << DCI_POSITION_ESCR_LSC)|
                             ((uint32_t)hdci->Init.SyncroCode.LineEndCode << DCI_POSITION_ESCR_LEC) |
                             ((uint32_t)hdci->Init.SyncroCode.FrameEndCode << DCI_POSITION_ESCR_FEC));
  }

  /* Enable the Line, Vsync, Error and Overrun interrupts */
  __DAL_DCI_ENABLE_IT(hdci, DCI_IT_LINE | DCI_IT_VSYNC | DCI_IT_ERR | DCI_IT_OVR);

  /* Update error code */
  hdci->ErrorCode = DAL_DCI_ERROR_NONE;

  /* Initialize the DCI state*/
  hdci->State  = DAL_DCI_STATE_READY;

  return DAL_OK;
}

/**
  * @brief  Deinitializes the DCI peripheral registers to their default reset
  *         values.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval DAL status
  */

DAL_StatusTypeDef DAL_DCI_DeInit(DCI_HandleTypeDef *hdci)
{
#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)  
  if(hdci->MspDeInitCallback == NULL)  
  {
    hdci->MspDeInitCallback = DAL_DCI_MspDeInit;
  }
  /* De-Initialize the low level hardware (MSP) */
  hdci->MspDeInitCallback(hdci);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC and DMA */
  DAL_DCI_MspDeInit(hdci);
#endif /* (USE_DAL_DCI_REGISTER_CALLBACKS) */

  /* Update error code */
  hdci->ErrorCode = DAL_DCI_ERROR_NONE;

  /* Initialize the DCI state*/
  hdci->State = DAL_DCI_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(hdci);

  return DAL_OK;
}

/**
  * @brief  Initializes the DCI MSP.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval None
  */
__weak void DAL_DCI_MspInit(DCI_HandleTypeDef* hdci)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdci);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_DCI_MspInit could be implemented in the user file
   */ 
}

/**
  * @brief  DeInitializes the DCI MSP.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval None
  */
__weak void DAL_DCI_MspDeInit(DCI_HandleTypeDef* hdci)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdci);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_DCI_MspDeInit could be implemented in the user file
   */
}

/**
  * @}
  */
/** @defgroup DCI_Exported_Functions_Group2 IO operation functions
  *  @brief   IO operation functions
  *
@verbatim
 ===============================================================================
                      #####  IO operation functions  #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure destination address and data length and
          Enables DCI DMA request and enables DCI capture
      (+) Stop the DCI capture.
      (+) Handles DCI interrupt request.

@endverbatim
  * @{
  */

/**
  * @brief  Enables DCI DMA request and enables DCI capture
  * @param  hdci     pointer to a DCI_HandleTypeDef structure that contains
  *                    the configuration information for DCI.
  * @param  DCI_Mode DCI capture mode snapshot or continuous grab.
  * @param  pData     The destination memory Buffer address (LCD Frame buffer).
  * @param  Length    The length of capture to be transferred.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DCI_Start_DMA(DCI_HandleTypeDef* hdci, uint32_t DCI_Mode, uint32_t pData, uint32_t Length)
{
  /* Initialize the second memory address */
  uint32_t SecondMemAddress = 0U;

  /* Check function parameters */
  ASSERT_PARAM(IS_DCI_CAPTURE_MODE(DCI_Mode));

  /* Process Locked */
  __DAL_LOCK(hdci);

  /* Lock the DCI peripheral state */
  hdci->State = DAL_DCI_STATE_BUSY;
  
