betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dci.c
  /* Enable DCI by setting DCIEN bit */
  __DAL_DCI_ENABLE(hdci);

  /* Configure the DCI Mode */
  hdci->Instance->CTRL &= ~(DCI_CTRL_CMODE);
  hdci->Instance->CTRL |=  (uint32_t)(DCI_Mode);

  /* Set the DMA memory0 conversion complete callback */
  hdci->DMA_Handle->XferCpltCallback = DCI_DMAXferCplt;

  /* Set the DMA error callback */
  hdci->DMA_Handle->XferErrorCallback = DCI_DMAError;

  /* Set the dma abort callback */
  hdci->DMA_Handle->XferAbortCallback = NULL;
  
  /* Reset transfer counters value */ 
  hdci->XferCount = 0U;
  hdci->XferTransferNumber = 0U;

  if(Length <= 0xFFFFU)
  {
    /* Enable the DMA Stream */
    DAL_DMA_Start_IT(hdci->DMA_Handle, (uint32_t)&hdci->Instance->DATA, (uint32_t)pData, Length);
  }
  else /* DCI_DOUBLE_BUFFER Mode */
  {
    /* Set the DMA memory1 conversion complete callback */
    hdci->DMA_Handle->XferM1CpltCallback = DCI_DMAXferCplt;

    /* Initialize transfer parameters */
    hdci->XferCount = 1U;
    hdci->XferSize = Length;
    hdci->pBuffPtr = pData;

    /* Get the number of buffer */
    while(hdci->XferSize > 0xFFFFU)
    {
      hdci->XferSize = (hdci->XferSize/2U);
      hdci->XferCount = hdci->XferCount*2U;
    }

    /* Update DCI counter and transfer number*/
    hdci->XferCount = (hdci->XferCount - 2U);
    hdci->XferTransferNumber = hdci->XferCount;

    /* Update second memory address */
    SecondMemAddress = (uint32_t)(pData + (4U*hdci->XferSize));

    /* Start DMA multi buffer transfer */
    DAL_DMAEx_MultiBufferStart_IT(hdci->DMA_Handle, (uint32_t)&hdci->Instance->DATA, (uint32_t)pData, SecondMemAddress, hdci->XferSize);
  }

  /* Enable Capture */
  hdci->Instance->CTRL |= DCI_CTRL_CEN;

  /* Release Lock */
  __DAL_UNLOCK(hdci);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Disable DCI DMA request and Disable DCI capture
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DCI_Stop(DCI_HandleTypeDef* hdci)
{
  __IO uint32_t count = SystemCoreClock / DAL_TIMEOUT_DCI_STOP;
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hdci);
  
  /* Lock the DCI peripheral state */
  hdci->State = DAL_DCI_STATE_BUSY;

  /* Disable Capture */
  hdci->Instance->CTRL &= ~(DCI_CTRL_CEN);

  /* Check if the DCI capture effectively disabled */
  do
  {
    if (count-- == 0U)
    {
      /* Update error code */
      hdci->ErrorCode |= DAL_DCI_ERROR_TIMEOUT;

      status = DAL_TIMEOUT;
      break;
    }
  }
  while((hdci->Instance->CTRL & DCI_CTRL_CEN) != 0U);

  /* Disable the DCI */
  __DAL_DCI_DISABLE(hdci);

  /* Disable the DMA */
  DAL_DMA_Abort(hdci->DMA_Handle);

  /* Update error code */
  hdci->ErrorCode |= DAL_DCI_ERROR_NONE;

  /* Change DCI state */
  hdci->State = DAL_DCI_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(hdci);

  /* Return function status */
  return status;
}

/**
  * @brief  Suspend DCI capture  
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI. 
  * @retval DAL status     
  */
DAL_StatusTypeDef DAL_DCI_Suspend(DCI_HandleTypeDef* hdci)
{
  __IO uint32_t count = SystemCoreClock / DAL_TIMEOUT_DCI_STOP;
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hdci);

  if(hdci->State == DAL_DCI_STATE_BUSY)
  {
    /* Change DCI state */
    hdci->State = DAL_DCI_STATE_SUSPENDED;

    /* Disable Capture */
    hdci->Instance->CTRL &= ~(DCI_CTRL_CEN);

    /* Check if the DCI capture effectively disabled */
    do
    {
      if (count-- == 0U)
      {        
        /* Update error code */
        hdci->ErrorCode |= DAL_DCI_ERROR_TIMEOUT;
        
        /* Change DCI state */
        hdci->State = DAL_DCI_STATE_READY;
        
        status = DAL_TIMEOUT;
        break;
      }
    }
    while((hdci->Instance->CTRL & DCI_CTRL_CEN) != 0);
  }    
  /* Process Unlocked */
  __DAL_UNLOCK(hdci);
  
  /* Return function status */
  return status;
}

/**
  * @brief  Resume DCI capture  
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI. 
  * @retval DAL status     
  */
DAL_StatusTypeDef DAL_DCI_Resume(DCI_HandleTypeDef* hdci)
{
  /* Process locked */
  __DAL_LOCK(hdci);
  
  if(hdci->State == DAL_DCI_STATE_SUSPENDED)
  {
    /* Change DCI state */
    hdci->State = DAL_DCI_STATE_BUSY;
    
    /* Disable Capture */
    hdci->Instance->CTRL |= DCI_CTRL_CEN;
  } 
  /* Process Unlocked */
  __DAL_UNLOCK(hdci);
  
  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Handles DCI interrupt request.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for the DCI.
  * @retval None
  */
void DAL_DCI_IRQHandler(DCI_HandleTypeDef *hdci)
{
  uint32_t isr_value = READ_REG(hdci->Instance->MINTSTS);

  /* Synchronization error interrupt management *******************************/
  if((isr_value & DCI_FLAG_ERRRI) == DCI_FLAG_ERRRI)
  {
    /* Clear the Synchronization error flag */
    __DAL_DCI_CLEAR_FLAG(hdci, DCI_FLAG_ERRRI);

    /* Update error code */
    hdci->ErrorCode |= DAL_DCI_ERROR_SYNC;

    /* Change DCI state */
    hdci->State = DAL_DCI_STATE_ERROR;
    
    /* Set the synchronization error callback */
    hdci->DMA_Handle->XferAbortCallback = DCI_DMAError;

    /* Abort the DMA Transfer */
    DAL_DMA_Abort_IT(hdci->DMA_Handle);
  }
  /* Overflow interrupt management ********************************************/
  if((isr_value & DCI_FLAG_OVRRI) == DCI_FLAG_OVRRI)
  {
    /* Clear the Overflow flag */
    __DAL_DCI_CLEAR_FLAG(hdci, DCI_FLAG_OVRRI);

    /* Update error code */
    hdci->ErrorCode |= DAL_DCI_ERROR_OVR;

    /* Change DCI state */
    hdci->State = DAL_DCI_STATE_ERROR;
    
    /* Set the overflow callback */
    hdci->DMA_Handle->XferAbortCallback = DCI_DMAError;

