betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dci.c
    /* Abort the DMA Transfer */
    DAL_DMA_Abort_IT(hdci->DMA_Handle);
  }
  /* Line Interrupt management ************************************************/
  if((isr_value & DCI_FLAG_LINERI) == DCI_FLAG_LINERI)
  {
    /* Clear the Line interrupt flag */
    __DAL_DCI_CLEAR_FLAG(hdci, DCI_FLAG_LINERI);
    
    /* Line interrupt Callback */
#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)
    /*Call registered DCI line event callback*/
    hdci->LineEventCallback(hdci);
#else  
    DAL_DCI_LineEventCallback(hdci);
#endif /* USE_DAL_DCI_REGISTER_CALLBACKS */     
  }
  /* VSYNC interrupt management ***********************************************/
  if((isr_value & DCI_FLAG_VSYNCRI) == DCI_FLAG_VSYNCRI)
  {
    /* Clear the VSYNCRI flag */
    __DAL_DCI_CLEAR_FLAG(hdci, DCI_FLAG_VSYNCRI);
    
    /* VSYNC Callback */
#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)
    /*Call registered DCI vsync event callback*/
    hdci->VsyncEventCallback(hdci);
#else  
    DAL_DCI_VsyncEventCallback(hdci);
#endif /* USE_DAL_DCI_REGISTER_CALLBACKS */ 
  }
  /* FRAME interrupt management ***********************************************/
  if((isr_value & DCI_FLAG_FRAMERI) == DCI_FLAG_FRAMERI)
  {
    /* When snapshot mode, disable Vsync, Error and Overrun interrupts */
    if((hdci->Instance->CTRL & DCI_CTRL_CMODE) == DCI_MODE_SNAPSHOT)
    { 
      /* Disable the Line, Vsync, Error and Overrun interrupts */
      __DAL_DCI_DISABLE_IT(hdci, DCI_IT_LINE | DCI_IT_VSYNC | DCI_IT_ERR | DCI_IT_OVR);
    }

    /* Disable the Frame interrupt */
    __DAL_DCI_DISABLE_IT(hdci, DCI_IT_FRAME);

    /* Frame Callback */
#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)
    /*Call registered DCI frame event callback*/
    hdci->FrameEventCallback(hdci);
#else  
    DAL_DCI_FrameEventCallback(hdci);
#endif /* USE_DAL_DCI_REGISTER_CALLBACKS */      
  }
}

/**
  * @brief  Error DCI callback.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval None
  */
__weak void DAL_DCI_ErrorCallback(DCI_HandleTypeDef *hdci)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdci);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_DCI_ErrorCallback could be implemented in the user file
   */
}

/**
  * @brief  Line Event callback.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval None
  */
__weak void DAL_DCI_LineEventCallback(DCI_HandleTypeDef *hdci)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdci);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_DCI_LineEventCallback could be implemented in the user file
   */
}

/**
  * @brief  VSYNC Event callback.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval None
  */
__weak void DAL_DCI_VsyncEventCallback(DCI_HandleTypeDef *hdci)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdci);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_DCI_VsyncEventCallback could be implemented in the user file
   */
}

/**
  * @brief  Frame Event callback.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval None
  */
__weak void DAL_DCI_FrameEventCallback(DCI_HandleTypeDef *hdci)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdci);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_DCI_FrameEventCallback could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup DCI_Exported_Functions_Group3 Peripheral Control functions
  *  @brief    Peripheral Control functions
  *
@verbatim
 ===============================================================================
                    ##### Peripheral Control functions #####
 ===============================================================================
[..]  This section provides functions allowing to:
      (+) Configure the CROP feature.
      (+) Enable/Disable the CROP feature.

@endverbatim
  * @{
  */

/**
  * @brief  Configure the DCI CROP coordinate.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @param  X0    DCI window X offset
  * @param  Y0    DCI window Y offset
  * @param  XSize DCI Pixel per line
  * @param  YSize DCI Line number
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DCI_ConfigCrop(DCI_HandleTypeDef *hdci, uint32_t X0, uint32_t Y0, uint32_t XSize, uint32_t YSize)
{
  /* Process Locked */
  __DAL_LOCK(hdci);

  /* Lock the DCI peripheral state */
  hdci->State = DAL_DCI_STATE_BUSY;

  /* Check the parameters */
  ASSERT_PARAM(IS_DCI_WINDOW_COORDINATE(X0));
  ASSERT_PARAM(IS_DCI_WINDOW_COORDINATE(YSize));
  ASSERT_PARAM(IS_DCI_WINDOW_COORDINATE(XSize));
  ASSERT_PARAM(IS_DCI_WINDOW_HEIGHT(Y0));

  /* Configure CROP */
  hdci->Instance->CROPWSIZE = (XSize | (YSize << DCI_POSITION_CWSIZE_VLINE));
  hdci->Instance->CROPWSTAT = (X0 | (Y0 << DCI_POSITION_CWSTRT_VST));

  /* Initialize the DCI state*/
  hdci->State  = DAL_DCI_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(hdci);

  return DAL_OK;
}

/**
  * @brief  Disable the Crop feature.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DCI_DisableCrop(DCI_HandleTypeDef *hdci)
{
  /* Process Locked */
  __DAL_LOCK(hdci);

  /* Lock the DCI peripheral state */
  hdci->State = DAL_DCI_STATE_BUSY;

  /* Disable DCI Crop feature */
  hdci->Instance->CTRL &= ~(uint32_t)DCI_CTRL_CROPF;

  /* Change the DCI state*/
  hdci->State = DAL_DCI_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(hdci);

  return DAL_OK;
}

/**
  * @brief  Enable the Crop feature.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DCI_EnableCrop(DCI_HandleTypeDef *hdci)
{
  /* Process Locked */
  __DAL_LOCK(hdci);

  /* Lock the DCI peripheral state */
  hdci->State = DAL_DCI_STATE_BUSY;

  /* Enable DCI Crop feature */
  hdci->Instance->CTRL |= (uint32_t)DCI_CTRL_CROPF;

  /* Change the DCI state*/
  hdci->State = DAL_DCI_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(hdci);

  return DAL_OK;
}

/**
  * @brief  Set embedded synchronization delimiters unmasks.
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *               the configuration information for DCI.
  * @param  SyncUnmask pointer to a DCI_SyncUnmaskTypeDef structure that contains
  *                    the embedded synchronization delimiters unmasks.
  * @retval DAL status
  */
DAL_StatusTypeDef  DAL_DCI_ConfigSyncUnmask(DCI_HandleTypeDef *hdci, DCI_SyncUnmaskTypeDef *SyncUnmask)
{
  /* Process Locked */
  __DAL_LOCK(hdci);

  /* Lock the DCI peripheral state */
  hdci->State = DAL_DCI_STATE_BUSY;

  /* Write DCI embedded synchronization unmask register */
  hdci->Instance->ESYNCUM = (((uint32_t)SyncUnmask->FrameStartUnmask) |\
                           ((uint32_t)SyncUnmask->LineStartUnmask << DCI_ESYNCUM_LSDUM_Pos)|\
                           ((uint32_t)SyncUnmask->LineEndUnmask << DCI_ESYNCUM_LEDUM_Pos)|\
                           ((uint32_t)SyncUnmask->FrameEndUnmask << DCI_ESYNCUM_FEDUM_Pos));

  /* Change the DCI state*/
  hdci->State = DAL_DCI_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(hdci);

  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup DCI_Exported_Functions_Group4 Peripheral State functions
  *  @brief    Peripheral State functions
  *
@verbatim
 ===============================================================================
               ##### Peripheral State and Errors functions #####
 ===============================================================================
    [..]
    This subsection provides functions allowing to
      (+) Check the DCI state.
      (+) Get the specific DCI error flag.

@endverbatim
  * @{
  */ 

/**
  * @brief  Return the DCI state
  * @param  hdci pointer to a DCI_HandleTypeDef structure that contains
  *                the configuration information for DCI.
  * @retval DAL state
  */
DAL_DCI_StateTypeDef DAL_DCI_GetState(DCI_HandleTypeDef *hdci)
{
  return hdci->State;
}

/**
  * @brief  Return the DCI error code
  * @param  hdci  pointer to a DCI_HandleTypeDef structure that contains
  *               the configuration information for DCI.
  * @retval DCI Error Code
  */
uint32_t DAL_DCI_GetError(DCI_HandleTypeDef *hdci)
{
  return hdci->ErrorCode;
}

#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)
/**
  * @brief DCI Callback registering
  * @param hdci        pointer to a DCI_HandleTypeDef structure that contains
  *                     the configuration information for DCI.
  * @param CallbackID   dci Callback ID
  * @param pCallback    pointer to DCI_CallbackTypeDef structure
  * @retval status
  */
DAL_StatusTypeDef DAL_DCI_RegisterCallback(DCI_HandleTypeDef *hdci, DAL_DCI_CallbackIDTypeDef CallbackID, pDCI_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;
  
