betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dci.c
  if(pCallback == NULL)
  {
    /* update the error code */
    hdci->ErrorCode |= DAL_DCI_ERROR_INVALID_CALLBACK;  
    /* update return status */
    status = DAL_ERROR;
  }
  else
  {
    if(hdci->State == DAL_DCI_STATE_READY)
    {
      switch (CallbackID)
      {
      case DAL_DCI_FRAME_EVENT_CB_ID :
        hdci->FrameEventCallback = pCallback;
        break;
        
      case DAL_DCI_VSYNC_EVENT_CB_ID :
        hdci->VsyncEventCallback = pCallback;
        break; 
        
      case DAL_DCI_LINE_EVENT_CB_ID :
        hdci->LineEventCallback = pCallback;
        break;
        
      case DAL_DCI_ERROR_CB_ID :
        hdci->ErrorCallback = pCallback;
        break;
        
      case DAL_DCI_MSPINIT_CB_ID :
        hdci->MspInitCallback = pCallback;
        break;
        
      case DAL_DCI_MSPDEINIT_CB_ID :
        hdci->MspDeInitCallback = pCallback;
        break;	  
        
      default : 
        /* Return error status */
        status =  DAL_ERROR;
        break;
      }
    }
    else if(hdci->State == DAL_DCI_STATE_RESET)
    {
      switch (CallbackID)
      {
      case DAL_DCI_MSPINIT_CB_ID :
        hdci->MspInitCallback = pCallback;
        break;

      case DAL_DCI_MSPDEINIT_CB_ID :
        hdci->MspDeInitCallback = pCallback;
        break;	  
        
      default : 
        /* update the error code */
        hdci->ErrorCode |= DAL_DCI_ERROR_INVALID_CALLBACK;
        /* update return status */
        status = DAL_ERROR;
        break;
      }		
    }  
    else
    {
      /* update the error code */
      hdci->ErrorCode |= DAL_DCI_ERROR_INVALID_CALLBACK;
      /* update return status */
      status = DAL_ERROR;
    }
  }
  
  return status;
}

/**
  * @brief DCI Callback Unregistering
  * @param hdci       dci handle
  * @param CallbackID  dci Callback ID
  * @retval status
  */
DAL_StatusTypeDef DAL_DCI_UnRegisterCallback(DCI_HandleTypeDef *hdci, DAL_DCI_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;
  
  if(hdci->State == DAL_DCI_STATE_READY)
  {
    switch (CallbackID)
    {
    case DAL_DCI_FRAME_EVENT_CB_ID :
      hdci->FrameEventCallback = DAL_DCI_FrameEventCallback;  /* Legacy weak  FrameEventCallback  */ 
      break;
      
    case DAL_DCI_VSYNC_EVENT_CB_ID :
      hdci->VsyncEventCallback = DAL_DCI_VsyncEventCallback;  /* Legacy weak VsyncEventCallback       */ 
      break;
      
    case DAL_DCI_LINE_EVENT_CB_ID :
      hdci->LineEventCallback = DAL_DCI_LineEventCallback;    /* Legacy weak LineEventCallback   */
      break;
      
    case DAL_DCI_ERROR_CB_ID :
      hdci->ErrorCallback = DAL_DCI_ErrorCallback;           /* Legacy weak ErrorCallback        */ 
      break;  
      
    case DAL_DCI_MSPINIT_CB_ID :
      hdci->MspInitCallback = DAL_DCI_MspInit;
      break;
      
    case DAL_DCI_MSPDEINIT_CB_ID :
      hdci->MspDeInitCallback = DAL_DCI_MspDeInit;
      break;	  
      
    default : 
      /* update the error code */
      hdci->ErrorCode |= DAL_DCI_ERROR_INVALID_CALLBACK;
      /* update return status */
      status = DAL_ERROR;
      break;
    }
  }
  else if(hdci->State == DAL_DCI_STATE_RESET)
  {
    switch (CallbackID)
    {
    case DAL_DCI_MSPINIT_CB_ID :
      hdci->MspInitCallback = DAL_DCI_MspInit;
      break;
      
    case DAL_DCI_MSPDEINIT_CB_ID :
      hdci->MspDeInitCallback = DAL_DCI_MspDeInit;
      break;	  
      
    default : 
      /* update the error code */
      hdci->ErrorCode |= DAL_DCI_ERROR_INVALID_CALLBACK;
      /* update return status */
      status = DAL_ERROR;
      break;
    }		
  }   
  else
  {
    /* update the error code */
    hdci->ErrorCode |= DAL_DCI_ERROR_INVALID_CALLBACK;
    /* update return status */
    status = DAL_ERROR;
  }
  
  return status;
}
#endif /* USE_DAL_DCI_REGISTER_CALLBACKS */

/**
  * @}
  */
/* Private functions ---------------------------------------------------------*/
/** @defgroup DCI_Private_Functions DCI Private Functions
  * @{
  */

/**
  * @brief  DMA conversion complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA module.
  * @retval None
  */
static void DCI_DMAXferCplt(DMA_HandleTypeDef *hdma)
{
  uint32_t tmp = 0U;
 
  DCI_HandleTypeDef* hdci = ( DCI_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;
  
  if(hdci->XferCount != 0U)
  {
    /* Update memory 0 address location */
    tmp = ((hdci->DMA_Handle->Instance->SCFG) & DMA_SCFGx_CTARG);
    if(((hdci->XferCount % 2U) == 0U) && (tmp != 0U))
    {
      tmp = hdci->DMA_Handle->Instance->M0ADDR;
      DAL_DMAEx_ChangeMemory(hdci->DMA_Handle, (tmp + (8U*hdci->XferSize)), MEMORY0);
      hdci->XferCount--;
    }
    /* Update memory 1 address location */
    else if((hdci->DMA_Handle->Instance->SCFG & DMA_SCFGx_CTARG) == 0U)
    {
      tmp = hdci->DMA_Handle->Instance->M1ADDR;
      DAL_DMAEx_ChangeMemory(hdci->DMA_Handle, (tmp + (8U*hdci->XferSize)), MEMORY1);
      hdci->XferCount--;
    }
  }
  /* Update memory 0 address location */
  else if((hdci->DMA_Handle->Instance->SCFG & DMA_SCFGx_CTARG) != 0U)
  {
    hdci->DMA_Handle->Instance->M0ADDR = hdci->pBuffPtr;
  }
  /* Update memory 1 address location */
  else if((hdci->DMA_Handle->Instance->SCFG & DMA_SCFGx_CTARG) == 0U)
  {
    tmp = hdci->pBuffPtr;
    hdci->DMA_Handle->Instance->M1ADDR = (tmp + (4U*hdci->XferSize));
    hdci->XferCount = hdci->XferTransferNumber;
  }
  
  /* Check if the frame is transferred */
  if(hdci->XferCount == hdci->XferTransferNumber)
  {
    /* Enable the Frame interrupt */
    __DAL_DCI_ENABLE_IT(hdci, DCI_IT_FRAME);
    
    /* When snapshot mode, set dci state to ready */
    if((hdci->Instance->CTRL & DCI_CTRL_CMODE) == DCI_MODE_SNAPSHOT)
    {  
      hdci->State= DAL_DCI_STATE_READY;
    }
  }
}

/**
  * @brief  DMA error callback 
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *                the configuration information for the specified DMA module.
  * @retval None
  */
static void DCI_DMAError(DMA_HandleTypeDef *hdma)
{
  DCI_HandleTypeDef* hdci = ( DCI_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;
  
  if(hdci->DMA_Handle->ErrorCode != DAL_DMA_ERROR_FE)
  {
    /* Initialize the DCI state*/
    hdci->State = DAL_DCI_STATE_READY;
  }

  /* DCI error Callback */
#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)
    /*Call registered DCI error callback*/
    hdci->ErrorCallback(hdci);
#else  
  DAL_DCI_ErrorCallback(hdci);
#endif /* USE_DAL_DCI_REGISTER_CALLBACKS */   

}

/**
  * @}
  */
  
/**
  * @}
  */
#endif /* APM32F407xx || APM32F417xx */
#endif /* DAL_DCI_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
